In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({"description":["PW Skills is your one-stop-shop for upscaling. Get maximum value for timeand resources you invest, with job-ready courses & high-technology,available at the lowest cost."]})

In [4]:
df1

                                         description
0  PW Skills is your one-stop-shop for upscaling....

In [5]:
pd.set_option('display.max_colwidth',1000)

In [6]:
df1

                                                                                                                                                                 description
0  PW Skills is your one-stop-shop for upscaling. Get maximum value for timeand resources you invest, with job-ready courses & high-technology,available at the lowest cost.

In [7]:
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)

In [8]:
df1

                                                                                                                                                                 description
0  PW Skills is your one-stop-shop for upscaling. Get maximum value for timeand resources you invest, with job-ready courses & high-technology,available at the lowest cost.

In [9]:
len("pw skills")

9

In [10]:
df1["char_len"] = df1['description'].apply(len)

In [11]:
df1

,description,char_len
0,"PW Skills is your one-stop-shop for upscaling. Get maximum value for timeand resources you invest, with job-ready courses & high-technology,available at the lowest cost.",169

In [12]:
a = "I am Lucky"
len(a)

10

In [13]:
len(a.split()) # no. of words

3

In [14]:
df1['description'].apply(lambda x: len(x.split()))

0    24
Name: description, dtype: int64

In [15]:
df1["word_count"] = df1['description'].apply(lambda x: len(x.split()))

In [16]:
df1

,description,char_len,word_count
0,"PW Skills is your one-stop-shop for upscaling. Get maximum value for timeand resources you invest, with job-ready courses & high-technology,available at the lowest cost.",169,24

In [17]:
data = {"text":["Hello data science", "I love ML", "I read ML book"]}
a = pd.DataFrame(data)

In [18]:
a

                 text
0  Hello data science
1           I love ML
2      I read ML book

In [19]:
a['text'].str.lower()

0    hello data science
1             i love ml
2        i read ml book
Name: text, dtype: object

In [20]:
a['text_lower'] = a['text'].str.lower()

In [21]:
a['text_lower']

0    hello data science
1             i love ml
2        i read ml book
Name: text_lower, dtype: object

In [22]:
a

                 text          text_lower
0  Hello data science  hello data science
1           I love ML           i love ml
2      I read ML book      i read ml book

In [23]:
a["text_upper"] = a['text'].str.upper()

In [24]:
a['text_upper']

0    HELLO DATA SCIENCE
1             I LOVE ML
2        I READ ML BOOK
Name: text_upper, dtype: object

In [25]:
a

                 text          text_lower          text_upper
0  Hello data science  hello data science  HELLO DATA SCIENCE
1           I love ML           i love ml           I LOVE ML
2      I read ML book      i read ml book      I READ ML BOOK

In [26]:
a['text'][0].startswith("H")

True

In [27]:
a['text'][1].startswith("I")

True

In [28]:
a['text'][1][-1].startswith("L")  # I Love ML

True

In [29]:
df2 = pd.DataFrame({'a':[1,2,4,5,6],
                  'b':[4,5,6,7,8]})
df2

   a  b
0  1  4
1  2  5
2  4  6
3  5  7
4  6  8

In [30]:
df2['mult_a_by_5'] = df2['a'] * 5

In [31]:
df2['mult_a_by_5']

0     5
1    10
2    20
3    25
4    30
Name: mult_a_by_5, dtype: int64

In [32]:
df2

   a  b  mult_a_by_5
0  1  4            5
1  2  5           10
2  4  6           20
3  5  7           25
4  6  8           30

In [33]:
# df2.drop('mult_a', axis=1, inplace=True)

In [34]:
df2

   a  b  mult_a_by_5
0  1  4            5
1  2  5           10
2  4  6           20
3  5  7           25
4  6  8           30

In [35]:
df2.a.mean()

3.6

In [36]:
df2.mult_a_by_5.mean()

18.0

In [37]:
df2.a.median()

4.0

In [38]:
df2.mult_a_by_5.median()

20.0

In [39]:
df2.a.mode()

0    1
1    2
2    4
3    5
4    6
Name: a, dtype: int64

In [40]:
df2.mult_a_by_5.mode()

0     5
1    10
2    20
3    25
4    30
Name: mult_a_by_5, dtype: int64

In [41]:
df2.a.min()

1

In [42]:
df2.a.max()

6

In [43]:
df2.mult_a_by_5.min()

5

In [44]:
df2.mult_a_by_5.max()

30

In [45]:
df2.a.sum()

18

In [46]:
df2.mult_a_by_5.sum()

90

In [47]:
df2.a.var()

4.3

In [48]:
df2.mult_a_by_5.var()

107.5

In [49]:
df2.a.describe()

count    5.000000
mean     3.600000
std      2.073644
min      1.000000
25%      2.000000
50%      4.000000
75%      5.000000
max      6.000000
Name: a, dtype: float64

In [50]:
df2

   a  b  mult_a_by_5
0  1  4            5
1  2  5           10
2  4  6           20
3  5  7           25
4  6  8           30

In [51]:
df2['b']

0    4
1    5
2    6
3    7
4    8
Name: b, dtype: int64

In [52]:
df2['mult_b_by_7'] = df2['b'] * 7

In [53]:
df2['mult_b_by_7']

0    28
1    35
2    42
3    49
4    56
Name: mult_b_by_7, dtype: int64

In [54]:
df2

   a  b  mult_a_by_5  mult_b_by_7
0  1  4            5           28
1  2  5           10           35
2  4  6           20           42
3  5  7           25           49
4  6  8           30           56

In [55]:
df2.b.mean()

6.0

In [56]:
df2.mult_b_by_7.mean()

42.0

In [57]:
df2.b.median()

6.0

In [58]:
df2.mult_b_by_7.median()

42.0

In [59]:
df2.b.mode()

0    4
1    5
2    6
3    7
4    8
Name: b, dtype: int64

In [60]:
df2.mult_b_by_7.mode()

0    28
1    35
2    42
3    49
4    56
Name: mult_b_by_7, dtype: int64

In [61]:
df2.b.min()

4

In [62]:
df2.mult_b_by_7.min()

28

In [63]:
df2.b.max()

8

In [64]:
df2.mult_b_by_7.max()

56

In [65]:
df2.b.sum()

30

In [66]:
df2.mult_b_by_7.sum()

210

In [67]:
df2.b.var()

2.5

In [68]:
df2.mult_b_by_7.var()

122.5

In [69]:
df2.b.describe()

count    5.000000
mean     6.000000
std      1.581139
min      4.000000
25%      5.000000
50%      6.000000
75%      7.000000
max      8.000000
Name: b, dtype: float64

In [70]:
df2.mult_b_by_7.describe()

count     5.000000
mean     42.000000
std      11.067972
min      28.000000
25%      35.000000
50%      42.000000
75%      49.000000
max      56.000000
Name: mult_b_by_7, dtype: float64

In [71]:
df3 = pd.DataFrame({"a": [1,2,3,4,5,6,7,8,9]})
df3

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [72]:
df3.a.mean()

5.0

In [73]:
df3

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [74]:
df3.rolling(window = 1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [75]:
df3.rolling(window = 2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [76]:
df4 = df3.rolling(window = 3).mean()

In [77]:
df4

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [78]:
df4.dropna(inplace=True)

In [79]:
df4

     a
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [80]:
# Typecasting
df4['a_int'] = df4['a'].astype(int)

In [81]:
df4

     a  a_int
2  2.0      2
3  3.0      3
4  4.0      4
5  5.0      5
6  6.0      6
7  7.0      7
8  8.0      8

In [82]:
df3.rolling(window = 2).sum()

      a
0   NaN
1   3.0
2   5.0
3   7.0
4   9.0
5  11.0
6  13.0
7  15.0
8  17.0

In [83]:
df3.rolling(window = 2).min()

     a
0  NaN
1  1.0
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [84]:
df3.rolling(window = 2).max()

     a
0  NaN
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [85]:
import numpy as np
np.random.choice(['A', 'B'])

'B'

In [86]:
df3['Group'] = np.random.choice(['A', 'B'], size=9)

In [87]:
df3

   a Group
0  1     B
1  2     B
2  3     B
3  4     B
4  5     B
5  6     B
6  7     A
7  8     A
8  9     B

In [88]:
# Group with rolling sum
df3.groupby('Group')['a'].rolling(window = 2).sum()

Group
A      6     NaN
       7    15.0
B      0     NaN
       1     3.0
       2     5.0
       3     7.0
       4     9.0
       5    11.0
       8    15.0
Name: a, dtype: float64

In [89]:
df3.a.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
Name: a, dtype: int64

In [90]:
df5 = pd.DataFrame({"date": ['2024-03-08', '2024-03-09', '2024-03-10']})

In [91]:
df5

         date
0  2024-03-08
1  2024-03-09
2  2024-03-10

In [92]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [93]:
df5.dtypes

date    object
dtype: object

In [94]:
df5['updated_date'] = pd.to_datetime(df5["date"])

In [95]:
df5

         date updated_date
0  2024-03-08   2024-03-08
1  2024-03-09   2024-03-09
2  2024-03-10   2024-03-10

In [96]:
df5.dtypes

date                    object
updated_date    datetime64[ns]
dtype: object

In [97]:
df5['year'] = df5['updated_date'].dt.year

In [98]:
df5

         date updated_date  year
0  2024-03-08   2024-03-08  2024
1  2024-03-09   2024-03-09  2024
2  2024-03-10   2024-03-10  2024

In [99]:
df5['month'] = df5['updated_date'].dt.month

In [100]:
df5

         date updated_date  year  month
0  2024-03-08   2024-03-08  2024      3
1  2024-03-09   2024-03-09  2024      3
2  2024-03-10   2024-03-10  2024      3

In [101]:
df5['day'] = df5['updated_date'].dt.day

In [102]:
df5

         date updated_date  year  month  day
0  2024-03-08   2024-03-08  2024      3    8
1  2024-03-09   2024-03-09  2024      3    9
2  2024-03-10   2024-03-10  2024      3   10